{
    "language":"DE",
    "documentation": "Dokumentation", 
    "aboutUs": "Über uns", 
    "gtcs":"AGB",
    "minimization":"Minimierung", 
    "maximization": "Maximierung", 
    "condition": "Bedingung",
    "constraint": "Nebenbedingung", 
    "addConstraint": "Neue Nebenbedingung", 
    "solve": "Lösen", 
    "optimizationType": "Art des Problems:", 
    "aboutUsText": "Hi! Wir sind Hannah, Jona, Tom und Nele, ein Team aus Wirtschaftsinformatik-Studierenden der Hochschule Lingen im 5. Semester. Im Rahmen unseres Programmierprojekts haben wir LinSolve entwickelt – die Plattform, die euch bei mathematischen Problemen im Bereich Operations Research (OR) unter die Arme greift. Unsere Mission? OR-Probleme schnell und einfach lösen – ohne komplizierte Tools. LinSolve hilft euch bei linearen Gleichungen, Optimierungsproblemen und mehr, und das auf verständliche Weise. Entwickelt von Studierenden für Studierende, wollen wir den Studienalltag erleichtern. Testet LinSolve und gebt uns Feedback – wir freuen uns drauf! Euer LinSolve-Team ",
    "aboutUsHeadline": " Über uns – Das LinSolve-Team", 
    "gtcsHeadline":"Allgemeine Geschäftsbedingungen (AGB) für LinSolve", 
    "scope": "Geltungsbereich",
    "scopeText": " Diese Allgemeinen Geschäftsbedingungen (AGB) regeln die Nutzung der Website LinSolve und der damit verbundenen Dienstleistungen. Durch den Zugriff auf und die Nutzung der Website erklärst du dich mit den folgenden Bedingungen einverstanden.",
    "⁠useOfTheWebsite":"Nutzung der Website", 
    "⁠useOfTheWebsiteText": " LinSolve ist eine Open-Source-Plattform, die Studierende bei der Lösung mathematischer Probleme im Bereich Operations Research (OR) unterstützt. Alle auf dieser Website zur Verfügung gestellten Inhalte und Tools dürfen kostenlos genutzt werden.", 
    "⁠openSourceLicense" : "Open Source Lizenz", 
    "openSourceLizenzText" : "Der zugrunde liegende Code von LinSolve ist Open Source und unterliegt der [hier passende Open-Source-Lizenz einfügen, z.B. MIT-Lizenz]. Das bedeutet, dass du den Code herunterladen, modifizieren und weiterverbreiten kannst, solange die Bedingungen der jeweiligen Lizenz eingehalten werden. Für detaillierte Informationen zur Lizenz und deren Bedingungen lies bitte die entsprechende Dokumentation im Repository.", 
    "disclaimer": "Haftungsausschluss", 
    "disclaimerText": "LinSolve und die Entwickler übernehmen keine Haftung für die Richtigkeit, Vollständigkeit oder Aktualität der bereitgestellten Informationen und Berechnungen. Die Nutzung der Website erfolgt auf eigene Gefahr. Für mögliche Fehler oder Schäden, die durch die Nutzung der Plattform entstehen, übernehmen wir keine Verantwortung.", 
    "changesAndAvailability": "Änderungen und Verfügbarkeit", 
    "changesAndAvailabilityText": " Wir behalten uns das Recht vor, die Website jederzeit zu aktualisieren, zu verändern oder vorübergehend oder dauerhaft einzustellen. Für eventuelle Ausfallzeiten oder Datenverluste haften wir nicht.",
    "⁠dataProtection":"Datenschutz",
    "dataProtectionText":"LinSolve erhebt keine personenbezogenen Daten, es sei denn, du kontaktierst uns freiwillig über Feedback-Formulare oder E-Mail. In diesem Fall werden die Daten ausschließlich zur Beantwortung deiner Anfragen genutzt und nicht an Dritte weitergegeben.", 
    "⁠applicableLaw": "Anwendbares Recht", 
    "⁠applicablaLawText": "Diese AGB unterliegen dem deutschen Recht.",
    "bounds": "Beschränkungen",
    "gerneralProblem": "Allgemeines Problem", 
    "specificProblem": "Spezifisches Problem",
    "importProblem":"Aufgabe Hochladen", 
    "writeHere":"Schreibe hier", 
    "variable": "Variable",
    "optimalValue": "Optimaler Wert", 
    "mathematicallySolution": "Mathematische Lösung:", 
    "objectiveFunctionValue":"Zielfunktionwert", 
    "solutionErrorMessage":"Dieses Problem ist nicht Lösbar", 
    "goHome":"Hauptmenü",
    "imprint":"Impressum",
    "imprintTitle":"Verantwortlich für den Inhalt:",
    "imprintName":"Nele Hensel",
    "imprintStudent":"Studentin im Fachbereich Wirtschaftsinformatik",
    "imprintHS":"Hochschule Osnabrück",
    "imprintAddressTitle":"Adresse der Hochschule:",
    "imprintStreet":"Albrechtstraße 30",
    "imprintCity": "49076 Osnabrück",
    "imprintContact":"{'nele.hensel@hs-osnabrueck.de'} ",
    "privacyPolicy":"Datenschutzerklärung",
    "privacyNote":"Datenschutz auf einen Blick Allgemeine Hinweise ",
    "privacyNotetext":"Die folgenden Hinweise geben einen einfachen Überblick darüber, was mit Ihren personenbezogenen Daten passiert, wenn Sie diese Website besuchen. Personenbezogene Daten sind alle Daten, mit denen Sie persönlich identifiziert werden können. Ausführliche Informationen zum Thema Datenschutz entnehmen Sie unserer unter diesem Text aufgeführten Datenschutzerklärung. ",
    "dataAcquisition": "Datenerfassung auf dieser Website",
    "responsibilityDataCollection":"Wer ist verantwortlich für die Datenerfassung auf dieser Website? ",
    "responsibilityText":"Die Datenverarbeitung auf dieser Website erfolgt durch den Websitebetreiber. Dessen Kontaktdaten können Sie dem Abschnitt „Hinweis zur Verantwortlichen Stelle“ in dieser Datenschutzerklärung entnehmen. ",
    "dataCollection":"Wie erfassen wir Ihre Daten? ",
    "dataColleczionTetxt":"Ihre Daten werden erhoben, wenn Sie uns diese mitteilen, beispielsweise durch das Eingeben mathematischer Aufgaben oder beim Kontaktieren über die bereitgestellte E-Mail-Adresse. Weitere Daten werden automatisch durch unsere IT-Systeme erfasst, sobald Sie die Website besuchen. Dabei handelt es sich vor allem um technische Daten (z. B. IP-Adresse, Internetbrowser, Betriebssystem oder Uhrzeit des Seitenaufrufs).",
    "benefitData":"Wofür nutzen wir Ihre Daten? ",
    "benefitDataText":"Wir erheben Ihre Daten, um den Service der mathematischen Berechnung von OR-Problemen bereitzustellen und Ihnen die Ergebnisse zur Verfügung zu stellen.",
    "rightsData":"Welche Rechte haben Sie bezüglich Ihrer Daten? ",
    "rightsDataText":"Sie haben jederzeit das Recht, unentgeltlich Auskunft über Herkunft, Empfänger und Zweck Ihrer gespeicherten personenbezogenen Daten zu erhalten. Sie haben außerdem ein Recht, die Berichtigung oder Löschung dieser Daten zu verlangen. Wenn Sie eine Einwilligung zur Datenverarbeitung erteilt haben, können Sie diese Einwilligung jederzeit für die Zukunft widerrufen. Außerdem haben Sie das Recht, unter bestimmten Umständen die Einschränkung der Verarbeitung Ihrer personenbezogenen Daten zu verlangen. Des Weiteren steht Ihnen ein Beschwerderecht bei der zuständigen Aufsichtsbehörde zu. Hierzu sowie zu weiteren Fragen zum Thema Datenschutz können Sie sich jederzeit an uns wenden.",
    "hosting":"Hosting",
    "hostingText":"Wir hosten die Inhalte unserer Website bei folgendem Anbieter: ",
    "externHosting":"Externes Hosting",
    "externHostingText":"Diese Website wird extern gehostet. Die personenbezogenen Daten, die auf dieser Website erfasst werden, werden auf den Servern des Hosters / der Hoster gespeichert. Hierbei kann es sich v. a. um IP-Adressen, Kontaktanfragen, Meta- und Kommunikationsdaten, Vertragsdaten, Kontaktdaten, Namen, Websitezugriffe und sonstige Daten, die über eine Website generiert werden, handeln. ",
    "externHostingTextDSVGO":"Das externe Hosting erfolgt zum Zwecke der Vertragserfüllung gegenüber unseren potenziellen und bestehenden Kunden (Art. 6 Abs. 1 lit. b DSGVO) und im Interesse einer sicheren, schnellen und effizienten Bereitstellung unseres Online-Angebots durch einen professionellen Anbieter (Art. 6 Abs. 1 lit. f DSGVO). Sofern eine entsprechende Einwilligung abgefragt wurde, erfolgt die Verarbeitung ausschließlich auf Grundlage von Art. 6 Abs. 1 lit. a DSGVO und § 25 Abs. 1 TDDDG, soweit die Einwilligung die Speicherung von Cookies oder den Zugriff auf Informationen im Endgerät des Nutzers (z. B. Device-Fingerprinting) im Sinne des TDDDG umfasst. Die Einwilligung ist jederzeit widerrufbar. Unser(e) Hoster wird bzw. werden Ihre Daten nur insoweit verarbeiten, wie dies zur Erfüllung seiner Leistungspflichten erforderlich ist und unsere Weisungen in Bezug auf diese Daten befolgen.  ",
    "hoster":"Wir setzen folgende(n) Hoster ein: ",
    "hosterName": "GitHub, Inc.",
    "hosterAddress": "88 Colin P Kelly Jr St",
    "hosterstreet": "San Francisco",
    "hosterCity": "CA 94107 United States of America",
    "hosterNumber": "+1 877 448 4820",
    "hosterEmail": "{'privacy@github.com'}",
    "privacyNotes":"Allgemeine Hinweise und Pflichtinformationen Datenschutz ",
    "privacyNotesText":"Die Betreiber dieser Seiten nehmen den Schutz Ihrer persönlichen Daten sehr ernst. Wir behandeln Ihre personenbezogenen Daten vertraulich und entsprechend den gesetzlichen Datenschutzvorschriften sowie dieser Datenschutzerklärung.Wenn Sie diese Website benutzen, werden verschiedene personenbezogene Daten erhoben. Personenbezogene Daten sind Daten, mit denen Sie persönlich identifiziert werden können. Die vorliegende Datenschutzerklärung erläutert, welche Daten wir erheben und wofür wir sie nutzen. Sie erläutert auch, wie und zu welchem Zweck das geschieht. Wir weisen darauf hin, dass die Datenübertragung im Internet (z. B. bei der Kommunikation per E-Mail) Sicherheitslücken aufweisen kann. Ein lückenloser Schutz der Daten vor dem Zugriff durch Dritte ist nicht möglich.",
    "privacyPosition":"Hinweis zur verantwortlichen Stelle ",
    "privacyPositionText":"Die verantwortliche Stelle für die Datenverarbeitung auf dieser Website ist: ",
    "storageDuration":"Speicherdauer",
    "storageDurationText":"Soweit innerhalb dieser Datenschutzerklärung keine speziellere Speicherdauer genannt wurde, verbleiben Ihre personenbezogenen Daten bei uns, bis der Zweck für die Datenverarbeitung entfällt. Wenn Sie ein berechtigtes Löschersuchen geltend machen oder eine Einwilligung zur Datenverarbeitung widerrufen, werden Ihre Daten gelöscht, sofern wir keine anderen rechtlich zulässigen Gründe für die Speicherung Ihrer personenbezogenen Daten haben (z. B. steuer- oder handelsrechtliche Aufbewahrungsfristen); im letztgenannten Fall erfolgt die Löschung nach Fortfall dieser Gründe. ",
    "generalNote":"Allgemeine Hinweise zu den Rechtsgrundlagen der Datenverarbeitung auf dieser Website ",
    "generalNoteText":"Sofern Sie in die Datenverarbeitung eingewilligt haben, verarbeiten wir Ihre personenbezogenen Daten auf Grundlage von Art. 6 Abs. 1 lit. a DSGVO bzw. Art. 9 Abs. 2 lit. a DSGVO, sofern besondere Datenkategorien nach Art. 9 Abs. 1 DSGVO verarbeitet werden. Im Falle einer ausdrücklichen Einwilligung in die Übertragung personenbezogener Daten in Drittstaaten erfolgt die Datenverarbeitung außerdem auf Grundlage von Art. 49 Abs. 1 lit. a DSGVO. Sofern Sie in die Speicherung von Cookies oder in den Zugriff auf Informationen in Ihr Endgerät (z. B. via Device-Fingerprinting) eingewilligt haben, erfolgt die Datenverarbeitung zusätzlich auf Grundlage von § 25 Abs. 1 TDDDG. Die Einwilligung ist jederzeit widerrufbar. Sind Ihre Daten zur Vertragserfüllung oder zur Durchführung vorvertraglicher Maßnahmen erforderlich, verarbeiten wir Ihre Daten auf Grundlage des Art. 6 Abs. 1 lit. b DSGVO. Des Weiteren verarbeiten wir Ihre Daten, sofern diese zur Erfüllung einer rechtlichen Verpflichtung erforderlich sind auf Grundlage von Art. 6 Abs. 1 lit. c DSGVO. Die Datenverarbeitung kann ferner auf Grundlage unseres berechtigten Interesses nach Art. 6 Abs. 1 lit. f DSGVO erfolgen. Über die jeweils im Einzelfall einschlägigen Rechtsgrundlagen wird in den folgenden Absätzen dieser Datenschutzerklärung informiert.",
    "receiver":"Empfänger von personenbezogenen Daten ",
    "receiverText":"Im Rahmen unserer Geschäftstätigkeit arbeiten wir mit verschiedenen externen Stellen zusammen. Dabei ist teilweise auch eine Übermittlung von personenbezogenen Daten an diese externen Stellen erforderlich. Wir geben personenbezogene Daten nur dann an externe Stellen weiter, wenn dies im Rahmen einer Vertragserfüllung erforderlich ist, wenn wir gesetzlich hierzu verpflichtet sind (z. B. Weitergabe von Daten an Steuerbehörden), wenn wir ein berechtigtes Interesse nach Art. 6 Abs. 1 lit. f DSGVO an der Weitergabe haben oder wenn eine sonstige Rechtsgrundlage die Datenweitergabe erlaubt. Beim Einsatz von Auftragsverarbeitern geben wir personenbezogene Daten unserer Kunden nur auf Grundlage eines gültigen Vertrags über Auftragsverarbeitung weiter. Im Falle einer gemeinsamen Verarbeitung wird ein Vertrag über gemeinsame Verarbeitung geschlossen. ",
    "recall":"Widerruf Ihrer Einwilligung zur Datenverarbeitung ",
    "recallText":"Viele Datenverarbeitungsvorgänge sind nur mit Ihrer ausdrücklichen Einwilligung möglich. Sie können eine bereits erteilte Einwilligung jederzeit widerrufen. Die Rechtmäßigkeit der bis zum Widerruf erfolgten Datenverarbeitung bleibt vom Widerruf unberührt. ",
    "contradiction":"Widerspruchsrecht gegen die Datenerhebung in besonderen Fällen sowie gegen Direktwerbung (Art. 21 DSGVO) ",
    "contradictionText":"WENN DIE DATENVERARBEITUNG AUF GRUNDLAGE VON ART. 6 ABS. 1 LIT. E ODER F DSGVO ERFOLGT, HABEN SIE JEDERZEIT DAS RECHT, AUS GRÜNDEN, DIE SICH AUS IHRER BESONDEREN SITUATION ERGEBEN, GEGEN DIE VERARBEITUNG IHRER PERSONENBEZOGENEN DATEN WIDERSPRUCH EINZULEGEN; DIES GILT AUCH FÜR EIN AUF DIESE BESTIMMUNGEN GESTÜTZTES PROFILING. DIE JEWEILIGE RECHTSGRUNDLAGE, AUF DENEN EINE VERARBEITUNG BERUHT, ENTNEHMEN SIE DIESER DATENSCHUTZERKLÄRUNG. WENN SIE WIDERSPRUCH EINLEGEN, WERDEN WIR IHRE BETROFFENEN PERSONENBEZOGENEN DATEN NICHT MEHR VERARBEITEN, ES SEI DENN, WIR KÖNNEN ZWINGENDE SCHUTZWÜRDIGE GRÜNDE FÜR DIE VERARBEITUNG NACHWEISEN, DIE IHRE INTERESSEN, RECHTE UND FREIHEITEN ÜBERWIEGEN ODER DIE VERARBEITUNG DIENT DER GELTENDMACHUNG, AUSÜBUNG ODER VERTEIDIGUNG VON RECHTSANSPRÜCHEN (WIDERSPRUCH NACH ART. 21 ABS. 1 DSGVO). WERDEN IHRE PERSONENBEZOGENEN DATEN VERARBEITET, UM DIREKTWERBUNG ZU BETREIBEN, SO HABEN SIE DAS RECHT, JEDERZEIT WIDERSPRUCH GEGEN DIE VERARBEITUNG SIE BETREFFENDER PERSONENBEZOGENER DATEN ZUM ZWECKE DERARTIGER WERBUNG EINZULEGEN; DIES GILT AUCH FÜR DAS PROFILING, SOWEIT ES MIT SOLCHER DIREKTWERBUNG IN VERBINDUNG STEHT. WENN SIE WIDERSPRECHEN, WERDEN IHRE PERSONENBEZOGENEN DATEN ANSCHLIESSEND NICHT MEHR ZUM ZWECKE DER DIREKTWERBUNG VERWENDET (WIDERSPRUCH NACH ART. 21 ABS. 2 DSGVO). ",
    "complains":"Beschwerderecht bei der zuständigen Aufsichtsbehörde ",
    "complainsText":"Im Falle von Verstößen gegen die DSGVO steht den Betroffenen ein Beschwerderecht bei einer Aufsichtsbehörde, insbesondere in dem Mitgliedstaat ihres gewöhnlichen Aufenthalts, ihres Arbeitsplatzes oder des Orts des mutmaßlichen Verstoßes zu. Das Beschwerderecht besteht unbeschadet anderweitiger verwaltungsrechtlicher oder gerichtlicher Rechtsbehelfe. ",
    "dataTransmission":"Recht auf Datenübertragung",
    "dataTransmissionText":"Sie haben das Recht, Daten, die wir auf Grundlage Ihrer Einwilligung oder in Erfüllung eines Vertrags automatisiert verarbeiten, an sich oder an einen Dritten in einem gängigen, maschinenlesbaren Format aushändigen zu lassen. Sofern Sie die direkte Übertragung der Daten an einen anderen Verantwortlichen verlangen, erfolgt dies nur, soweit es technisch machbar ist. ",
    "information":"Auskunft, Berichtigung und Löschung ",
    "informationText": "Sie haben das Recht, die Einschränkung der Verarbeitung Ihrer personenbezogenen Daten zu verlangen. Hierzu können Sie sich jederzeit an uns wenden. Das Recht auf Einschränkung der Verarbeitung besteht in folgenden Fällen: Wenn Sie die Richtigkeit Ihrer bei uns gespeicherten personenbezogenen Daten bestreiten, benötigen wir in der Regel Zeit, um dies zu überprüfen. Für die Dauer der Prüfung haben Sie das Recht, die Einschränkung der Verarbeitung Ihrer personenbezogenen Daten zu verlangen. Wenn die Verarbeitung Ihrer personenbezogenen Daten unrechtmäßig geschah/geschieht, können Sie statt der Löschung die Einschränkung der Datenverarbeitung verlangen. Wenn wir Ihre personenbezogenen Daten nicht mehr benötigen, Sie sie jedoch zur Ausübung, Verteidigung oder Geltendmachung von Rechtsansprüchen benötigen, haben Sie das Recht, statt der Löschung die Einschränkung der Verarbeitung Ihrer personenbezogenen Daten zu verlangen. Wenn Sie einen Widerspruch nach Art. 21 Abs. 1 DSGVO eingelegt haben, muss eine Abwägung zwischen Ihren und unseren Interessen vorgenommen werden. Solange noch nicht feststeht, wessen Interessen überwiegen, haben Sie das Recht, die Einschränkung der Verarbeitung Ihrer personenbezogenen Daten zu verlangen. Wenn Sie die Verarbeitung Ihrer personenbezogenen Daten eingeschränkt haben, dürfen diese Daten – von ihrer Speicherung abgesehen – nur mit Ihrer Einwilligung oder zur Geltendmachung, Ausübung oder Verteidigung von Rechtsansprüchen oder zum Schutz der Rechte einer anderen natürlichen oder juristischen Person oder aus Gründen eines wichtigen öffentlichen Interesses der Europäischen Union oder eines Mitgliedstaats verarbeitet werden.",
    "dataCollections":"Datenerfassung auf dieser Website ",
    "dataCollectionsText":"Wenn Sie auf unserer Website mathematische Berechnungen durchführen, speichern wir die von Ihnen eingegebenen Daten für die Bearbeitung und Lösung des mathematischen Problems. Diese Daten werden nach Abschluss der Berechnung automatisch gelöscht, es sei denn, Sie exportieren das Ergebnis. Wenn Sie uns per Email Anfragen zukommen lassen, werden Ihre Angaben aus dem Anfrageformular inklusive der von Ihnen dort angegebenen Kontaktdaten zwecks Bearbeitung der Anfrage und für den Fall von Anschlussfragen bei uns gespeichert. Diese Daten geben wir nicht ohne Ihre Einwilligung weiter.  Die Verarbeitung dieser Daten erfolgt auf Grundlage von Art. 6 Abs. 1 lit. b DSGVO, sofern Ihre Anfrage mit der Erfüllung eines Vertrags zusammenhängt oder zur Durchführung vorvertraglicher Maßnahmen erforderlich ist. In allen übrigen Fällen beruht die Verarbeitung auf unserem berechtigten Interesse an der effektiven Bearbeitung der an uns gerichteten Anfragen (Art. 6 Abs. 1 lit. f DSGVO) oder auf Ihrer Einwilligung (Art. 6 Abs. 1 lit. a DSGVO) sofern diese abgefragt wurde; die Einwilligung ist jederzeit widerrufbar. Die von Ihnen in der Email eingegebenen Daten verbleiben bei uns, bis Sie uns zur Löschung auffordern, Ihre Einwilligung zur Speicherung widerrufen oder der Zweck für die Datenspeicherung entfällt (z. B. nach abgeschlossener Bearbeitung Ihrer Anfrage). Zwingende gesetzliche Bestimmungen – insbesondere Aufbewahrungsfristen – bleiben unberührt.",
    "enquiry":"Anfrage per E-Mail ",
    "enquiryText":"Wenn Sie uns per E-Mail kontaktieren, wird Ihre Anfrage inklusive aller daraus hervorgehenden personenbezogenen Daten (Name, Anfrage) zum Zwecke der Bearbeitung Ihres Anliegens bei uns gespeichert und verarbeitet. Diese Daten geben wir nicht ohne Ihre Einwilligung weiter.  Die Verarbeitung dieser Daten erfolgt auf Grundlage von Art. 6 Abs. 1 lit. b DSGVO, sofern Ihre Anfrage mit der Erfüllung eines Vertrags zusammenhängt oder zur Durchführung vorvertraglicher Maßnahmen erforderlich ist. In allen übrigen Fällen beruht die Verarbeitung auf unserem berechtigten Interesse an der effektiven Bearbeitung der an uns gerichteten Anfragen (Art. 6 Abs. 1 lit. f DSGVO) oder auf Ihrer Einwilligung (Art. 6 Abs. 1 lit. a DSGVO) sofern diese abgefragt wurde; die Einwilligung ist jederzeit widerrufbar.  Die von Ihnen an uns per Kontaktanfragen übersandten Daten verbleiben bei uns, bis Sie uns zur Löschung auffordern, Ihre Einwilligung zur Speicherung widerrufen oder der Zweck für die Datenspeicherung entfällt (z. B. nach abgeschlossener Bearbeitung Ihres Anliegens). Zwingende gesetzliche Bestimmungen – insbesondere gesetzliche Aufbewahrungsfristen – bleiben unberührt.",
    "generalProblemInfo": "Ein allgemeines lineares Problem ist ein mathematisches Optimierungsproblem. Dabei soll eine lineare Zielfunktion maximiert oder minimiert werden. Gleichzeitig müssen lineare Gleichungen oder Ungleichungen als Restriktionen (Nebenbedingungen) eingehalten werden. Dezimalzahlen sind durch einen Punkt und nicht durch ein Komma zu trennen.",
    "generalProblemExample": "# Allgemeines lineares Optimierungsproblem\n# 1. Definiere Variablen\nvar x1; var x2;\n# 2. Zielfunktion: Maximiere oder minimiere\nmaximize Profit: 40 * x1 + 30 * x2;\n# 3. Restriktionen (Nebenbedingungen)\ns.t. Restriktion1: 2 * x1 + x2 <= 100;\n # Beispiel: Arbeitszeitbegrenzung\ns.t. Restriktion2: 3 * x1 + 2 * x2 <= 120;\n # Beispiel: Materialbegrenzung\n# 4. Löse das Problem\nsolve;\n# 5. Zeige die Ergebnisse\ndisplay x1, x2;\nend;",
    "specificProblemInfo": "Ein spezifisches Problem ist eine konkrete Aufgabe, die in einer bestimmten Situation oder einem bestimmten Szenario auftritt.",
    "inputProblemType": "Ein Maximierungsproblem zielt darauf ab, den Wert einer Zielfunktion, wie z.B. den Gewinn, unter gegebenen Bedingungen zu maximieren. Ein Minimierungsproblem zielt darauf ab, den Wert einer Zielfunktion, wie z.B. die Kosten, unter Einhaltung vorgegebener Restriktionen zu minimieren.",
    "inputCondition": "Eine Bedingung legt fest, welche Anforderungen oder Einschränkungen erfüllt sein müssen, damit eine Lösung, z. B. eine Gleichung oder eine Ungleichung, gültig ist. Dezimalzahlen sind durch einen Punkt und nicht durch ein Komma zu trennen. Sie ist so aufgebaut: x1 + 2 x2 + 3 x3 + x4",
    "inputSideCondition": "Eine Nebenbedingung (auch Restriktion genannt) ist eine spezielle Form einer Bedingung, die zusätzlich zur Zielfunktion erfüllt sein muss, um eine praktikable Lösung zu gewährleisten, wie z.B. Ressourcenbeschränkungen oder Kapazitätsgrenzen. Dezimalzahlen sind durch einen Punkt und nicht durch ein Komma zu trennen. Sie ist so aufgebaut: c1: - x1 + x2 + x3 + 10 x4 <= 20\nc2: x1 - 3 x2 + x3 <= 30\nc3: x2 - 3.5 x4 = 0",
    "inputConstraint": "Eine Beschränkung schränkt die möglichen Lösungen des Problems ein. Sie definiert die Rahmenbedingungen, innerhalb derer die Entscheidungsvariablen (z.B. Produktionsmengen, Transportkosten, Zeitaufwand) liegen müssen. Dezimalzahlen sind durch einen Punkt und nicht durch ein Komma zu trennen. Sie ist so aufgebaut: 0 <= x1 <= 40\n2 <= x4 <= 3",
    "showExample":"Beispiel", 
    "close":"Schließen",
    "uploadFile":"Datei Hochladen"
}