{
    "language":"EN",
    "documentation": "Documentation", 
    "aboutUs": "About us", 
    "gtcs":"GTCs",
    "minimization":"Minimization", 
    "maximization": "Maximization",
    "condition": "Condition",
    "constraint": "Constraint", 
    "addConstraint": "Add Constraint", 
    "solve": "Solve",
    "optimizationType":"Type of problem:", 
    "aboutUsText":"Hi, we are Hannah, Jona, Tom and Nele, a team of 5th semester Business Informatics students at Lingen University of Applied Sciences. As part of our programming project, we have developed LinSolve - the platform that helps you with mathematical problems in the field of Operations Research (OR). Our mission? To solve OR problems quickly and easily - without complicated tools. LinSolve helps you with linear equations, optimization problems and more, in an understandable way. Developed by students for students, we want to make everyday studying easier. Test LinSolve and give us feedback - we look forward to it! Your LinSolve team",
    "aboutUsHeadline": "About us - The LinSolve team", 
    "gtcsHeadline": "General Terms and Conditions (GTC) for LinSolve", 
    "scope": "Scope", 
    "scopeText": "These General Terms and Conditions (GTC) govern the use of the LinSolve website and the associated services. By accessing and using the website, you agree to the following terms.",
    "⁠useOfTheWebsite":" ⁠Use of the Website",
    "⁠useOfTheWebsiteText": "LinSolve is an open-source platform that supports students in solving mathematical problems in the field of Operations Research (OR). All content and tools provided on this website may be used free of charge.", 
    "openSourceLizenz": "Open Source Lizenz",
    "openSourceLizenzText" : "The underlying code of LinSolve is open source and is subject to the [insert applicable open-source license, e.g., MIT license]. This means that you may download, modify, and redistribute the code as long as the conditions of the respective license are met. For detailed information on the license and its conditions, please refer to the corresponding documentation in the repository.", 
    "disclaimer": "Disclaimer", 
    "disclaimerText": "LinSolve and its developers assume no liability for the accuracy, completeness, or timeliness of the provided information and calculations. The use of the website is at your own risk. We accept no responsibility for possible errors or damages resulting from the use of the platform.", 
    "changesAndAvailability": "⁠Changes and Availability", 
    "changesAndAvailabilityText": "We reserve the right to update, modify, or temporarily or permanently discontinue the website at any time. We are not liable for any downtime or data loss.",
    "⁠dataProtection":"Data Protection",
    "dataProtectionText":"LinSolve does not collect personal data unless you voluntarily contact us via feedback forms. In this case, the data will only be used to respond to your inquiries and will not be shared with third parties.",
    "⁠applicableLaw": "⁠Applicable Law",
    "⁠applicablaLawText":"These GTC are governed by German law.",
    "bounds": "Bounds",
    "gerneralProblem": "General Problem",
    "specificProblem": "Specific Problem", 
    "importProblem":"Import Task",
    "writeHere":"Write here", 
    "variable": "Variable",
    "optimalValue": "Optimal value",
    "mathematicallySolution": "Mathematically solution",
    "objectiveFunctionValue":"Objective function value", 
    "solutionErrorMessage":"This problem cannot be solved", 
    "goHome":"Homepage",
    "imprint":"Imprint",
    "imprintTitle":"Responsible for the content:",
    "imprintName":"Nele Hensel",
    "imprintStudent":"Student in the Business Informatics department",
    "imprintHS":"Hochschule Osnabrück",
    "imprintAddressTitle":"Address of the university:",
    "imprintStreet":"Albrechtstraße 30",
    "imprintCity": "49076 Osnabrück",
    "imprintContact":"{'nele.hensel@hs-osnabrueck.de'} ",
    "privacyPolicy": "Privacy Policy",
    "privacyNote": "Data protection at a glance - General Information",
    "privacyNotetext": "The following notes provide a simple overview of what happens to your personal data when you visit this website. Personal data is all data with which you can be personally identified. Detailed information on data protection can be found in our privacy policy listed below this text.",
    "dataAcquisition": "Data collection on this website",
    "responsibilityDataCollection": "Who is responsible for the data collection on this website?",
    "responsibilityText": "The data processing on this website is carried out by the website operator. You can find their contact details in the section 'Notice concerning the responsible party' in this privacy policy.",
    "dataCollection": "How do we collect your data?",
    "dataColleczionTetxt": "Your data is collected when you provide it to us, for example by entering mathematical tasks or by contacting us via the provided email address. Other data is collected automatically by our IT systems when you visit the website. This mainly includes technical data (e.g., IP address, internet browser, operating system, or time of page access).",
    "benefitData": "What do we use your data for?",
    "benefitDataText": "We collect your data to provide the service of solving mathematical OR problems and to deliver the results to you.",
    "rightsData": "What rights do you have regarding your data?",
    "rightsDataText": "You have the right to receive information about the origin, recipients, and purpose of your stored personal data at any time and free of charge. You also have the right to request the correction or deletion of this data. If you have consented to data processing, you can revoke this consent at any time for the future. Furthermore, you have the right to request the restriction of the processing of your personal data under certain circumstances. Additionally, you have the right to file a complaint with the competent supervisory authority. For this and other questions regarding data protection, you can contact us at any time.",
    "hosting": "Hosting",
    "hostingText": "We host the content of our website with the following provider:",
    "externHosting": "External Hosting",
    "externHostingText": "This website is hosted externally. The personal data collected on this website is stored on the servers of the host(s). This may include IP addresses, contact requests, meta and communication data, contract data, contact details, names, website accesses, and other data generated through a website.",
    "externHostingTextDSVGO": "External hosting is carried out for the purpose of fulfilling contracts with our potential and existing customers (Art. 6(1)(b) GDPR) and in the interest of providing our online services securely, quickly, and efficiently by a professional provider (Art. 6(1)(f) GDPR). If corresponding consent has been requested, the processing is based solely on Art. 6(1)(a) GDPR and § 25(1) TDDDG, insofar as the consent includes the storage of cookies or access to information on the user's device (e.g., device fingerprinting) in the sense of the TDDDG. The consent can be revoked at any time. Our host(s) will only process your data to the extent necessary to fulfill their performance obligations and follow our instructions regarding this data.",
    "hoster": "We use the following host(s):",
    "hosterName": "GitHub, Inc.",
    "hosterAddress": "88 Colin P Kelly Jr St",
    "hosterstreet": "San Francisco",
    "hosterCity": "CA 94107 United States of America",
    "hosterNumber": "+1 877 448 4820",
    "hosterEmail": "{'privacy@github.com'}",
    "privacyNotes": "General Notes and Mandatory Information on Data Protection",
    "privacyNotesText": "The operators of these pages take the protection of your personal data very seriously. We treat your personal data confidentially and in accordance with statutory data protection regulations and this privacy policy. When you use this website, various personal data are collected. Personal data is data with which you can be personally identified. This privacy policy explains what data we collect and what we use it for. It also explains how and for what purpose this happens. We point out that data transmission over the Internet (e.g., communication by email) can have security vulnerabilities. Complete protection of the data from access by third parties is not possible.",
    "privacyPosition": "Notice concerning the responsible party",
    "privacyPositionText": "The responsible party for data processing on this website is:",
    "storageDuration": "Storage Duration",
    "storageDurationText": "Unless a more specific retention period is stated within this privacy policy, your personal data will remain with us until the purpose for data processing no longer applies. If you assert a legitimate request for deletion or revoke your consent to data processing, your data will be deleted unless we have other legally permissible reasons for storing your personal data (e.g., tax or commercial retention periods); in the latter case, the deletion will take place after these reasons cease to apply.",
    "generalNote": "General Notes on the Legal Basis for Data Processing on This Website",
    "generalNoteText": "If you have consented to data processing, we process your personal data based on Art. 6(1)(a) GDPR or Art. 9(2)(a) GDPR if special categories of data are processed according to Art. 9(1) GDPR. In the case of explicit consent to the transfer of personal data to third countries, data processing is also based on Art. 49(1)(a) GDPR. If you have consented to the storage of cookies or access to information on your device (e.g., via device fingerprinting), data processing is additionally based on § 25(1) TDDDG. The consent can be revoked at any time. If your data is necessary for the fulfillment of a contract or for pre-contractual measures, we process your data based on Art. 6(1)(b) GDPR. Furthermore, we process your data insofar as it is necessary to fulfill a legal obligation based on Art. 6(1)(c) GDPR. Data processing may also be based on our legitimate interest under Art. 6(1)(f) GDPR. The applicable legal basis in each case is explained in the following paragraphs of this privacy policy.",
    "receiver": "Recipients of Personal Data",
    "receiverText": "In the course of our business activities, we work with various external entities. This may also require the transfer of personal data to these external entities. We only pass on personal data to external entities if this is necessary for the fulfillment of a contract, if we are legally obliged to do so (e.g., transfer of data to tax authorities), if we have a legitimate interest in the transfer according to Art. 6(1)(f) GDPR, or if another legal basis permits the data transfer. When using processors, we only transfer personal data of our customers based on a valid processing agreement. In the case of joint processing, a joint processing agreement will be concluded.",
    "recall": "Revocation of Your Consent to Data Processing",
    "recallText": "Many data processing operations are only possible with your express consent. You can revoke your consent at any time. The legality of the data processing carried out until the revocation remains unaffected by the revocation.",
    "contradiction": "Right to Object to Data Collection in Special Cases and to Direct Marketing (Art. 21 GDPR)",
    "contradictionText": "IF DATA PROCESSING IS BASED ON ART. 6(1)(E) OR (F) GDPR, YOU HAVE THE RIGHT TO OBJECT TO THE PROCESSING OF YOUR PERSONAL DATA AT ANY TIME FOR REASONS ARISING FROM YOUR PARTICULAR SITUATION; THIS ALSO APPLIES TO PROFILING BASED ON THESE PROVISIONS. THE RESPECTIVE LEGAL BASIS ON WHICH PROCESSING IS BASED CAN BE FOUND IN THIS PRIVACY POLICY. IF YOU OBJECT, WE WILL NO LONGER PROCESS YOUR PERSONAL DATA UNLESS WE CAN DEMONSTRATE COMPELLING LEGITIMATE GROUNDS FOR THE PROCESSING THAT OVERRIDE YOUR INTERESTS, RIGHTS, AND FREEDOMS OR THE PROCESSING SERVES THE ASSERTION, EXERCISE, OR DEFENSE OF LEGAL CLAIMS (OBJECTION UNDER ART. 21(1) GDPR). IF YOUR PERSONAL DATA IS PROCESSED FOR DIRECT MARKETING PURPOSES, YOU HAVE THE RIGHT TO OBJECT TO THE PROCESSING OF YOUR PERSONAL DATA FOR THE PURPOSE OF SUCH MARKETING AT ANY TIME; THIS ALSO APPLIES TO PROFILING TO THE EXTENT THAT IT IS RELATED TO SUCH DIRECT MARKETING. IF YOU OBJECT, YOUR PERSONAL DATA WILL NO LONGER BE USED FOR DIRECT MARKETING PURPOSES (OBJECTION UNDER ART. 21(2) GDPR).",
    "complains": "Right to File Complaints with Regulatory Authorities",
    "complainsText": "In the event of violations of the GDPR, data subjects have the right to file a complaint with a supervisory authority, in particular in the member state of their habitual residence, place of work, or the place of the alleged violation. The right to file a complaint exists without prejudice to other administrative or judicial remedies.",
    "dataTransmission": "Right to Data Portability",
    "dataTransmissionText": "You have the right to receive data that we process automatically based on your consent or in fulfillment of a contract in a commonly used, machine-readable format. If you request the direct transfer of data to another responsible party, this will only be done to the extent technically feasible.",
    "information": "Information, Correction, and Deletion",
    "informationText": "You have the right to request the restriction of the processing of your personal data. You can contact us at any time for this purpose. The right to restrict processing applies in the following cases: If you contest the accuracy of your personal data stored with us, we usually need time to verify this. For the duration of the verification, you have the right to request the restriction of the processing of your personal data. If the processing of your personal data was/is unlawful, you can request the restriction of data processing instead of deletion. If we no longer need your personal data, but you need it to exercise, defend, or assert legal claims, you have the right to request the restriction of the processing of your personal data instead of deletion. If you have lodged an objection pursuant to Art. 21(1) GDPR, a balance must be struck between your and our interests. As long as it has not been determined whose interests prevail, you have the right to request the restriction of the processing of your personal data. If you have restricted the processing of your personal data, this data – apart from being stored – may only be processed with your consent or for the establishment, exercise, or defense of legal claims or for the protection of the rights of another natural or legal person or for reasons of important public interest of the European Union or a member state.",
    "dataCollections": "Data Collection on this Website",
    "dataCollectionsText": "If you perform mathematical calculations on our website, the data you enter will be stored for processing and solving the mathematical problem. This data will be automatically deleted after the calculation is completed unless you export the result. If you send us inquiries via email, your information from the inquiry form, including the contact details you provide there, will be stored with us for the purpose of processing the inquiry and in case of follow-up questions. We do not share this data without your consent. The processing of this data is based on Art. 6(1)(b) GDPR, provided that your inquiry is related to the fulfillment of a contract or is necessary for the implementation of pre-contractual measures. In all other cases, the processing is based on our legitimate interest in the effective processing of inquiries addressed to us (Art. 6(1)(f) GDPR) or on your consent (Art. 6(1)(a) GDPR), if this has been requested; consent can be revoked at any time. The data you enter in the email will remain with us until you request deletion, revoke your consent to storage, or the purpose for storing the data no longer applies (e.g., after your request has been processed). Mandatory legal provisions – particularly retention periods – remain unaffected.",
    "enquiry": "Inquiry via Email",
    "enquiryText": "If you contact us via email, your request, including all resulting personal data (name, inquiry), will be stored and processed by us for the purpose of processing your request. We do not share this data without your consent. The processing of this data is based on Art. 6(1)(b) GDPR, provided that your inquiry is related to the fulfillment of a contract or is necessary for pre-contractual measures. In all other cases, the processing is based on our legitimate interest in the effective processing of inquiries addressed to us (Art. 6(1)(f) GDPR) or on your consent (Art. 6(1)(a) GDPR), if this has been requested; consent can be revoked at any time. The data you send to us via contact inquiries will remain with us until you request deletion, revoke your consent to storage, or the purpose for storing the data no longer applies (e.g., after your request has been processed). Mandatory legal provisions – particularly legal retention periods – remain unaffected.",
    "uploadFile": "Upload File"
}

